tutorials/0-nix-intro/README.md
- [Introduction to Nix](#orgca1b36c)
- [Motivation For Nix](#orge6d0309)
- [Exploring a Fresh Nix Installation](#orgca71b38)
- [The Nix Language](#orge42448c)
  - [Numeric literals](#orgbd6550f)
  - [Strings](#org29846bc)
  - [Let-expressions](#org10749c4)
  - [String interpolation](#org8d1b5ae)
  - [Functions](#org407081e)
  - [Lists](#org445bc1d)
  - [Attribute sets](#org933bc8d)
  - [Paths](#org436ad44)
  - [Importing](#org89730a6)
- [Nixpkgs and Building](#org77d49d7)
- [Calling `nix`](#orgdc9d11c)
- [Finding Packages](#orgb47b789)
- [Running](#org035db38)
- [Installing](#org7d89ddd)
- [Uninstalling](#org7614251)
- [Inspecting Dependencies](#org1ee89c2)
- [Cleaning Up](#org921025a)
- [Developing with `nix-shell`](#orgeae6024)



<a id="orgca1b36c"></a>

# Introduction to Nix

This tutorial illustrates some basic operation of Nix. We'll introduce some some concepts, terminology, and command-line utilities. That will provide some setup for building our own projects with Pkgs-make in later tutorials.


<a id="orge6d0309"></a>

# Motivation For Nix

Nix at its heart is a package manager that can build from source arbitrary packages written in a variety of languages, and also manage concurrent per-user installations.

Every programming language ecosystem has its particular set of tools for building and managing libraries (for instance, Python has PIP/Conda and Ruby has Gems). Reaching for a tool like the Nix package manager may at first seem redundant. For us, two central benefits of Nix are

-   ease to integrate artifacts from a variety of languages ecosystems
-   extreme build/deployment reproducibility.

Many languages use FFI wrapper libraries over native C libraries. Or they require oddly-compiled external dependencies for compilation or runtime. Furthermore, some domains like machine learning require the integration of different applications developed in languages like C/C++, R, or Python.

To maintain reproducibility while integrating such heterogeneous builds, we could use something like [Docker](https://www.docker.com). But most of these solutions involve opaque artifacts that are hard to trust. For instance, when we use a “debian:8.7” image from Docker Hub, it's not clear how to reproduce it if we have to. We just trust the community to have created a reasonable image which is then frozen with a version identifier “8.7” and published on Docker Hub. Furthermore, Docker makes no guarantee that two images created from the same Dockerfile will be equivalent.

The Nix package manager provides a better architecture for reproducible builds by treating the build process as a mathematical function. In Nix, these functions are written in a language also called Nix. And as in math, Nix expressions yield the same result, even when called at different times or on different machines (just as we trust `1 + 1` to evaluate to `2` on any machine at any time).

This allows us to reference and cache results with far more precision and resolution than we can with Docker's Dockerfiles. The Nix ecosystem even goes further by patching compilers to make compiled artifacts bit-for-bit reproducible. And because Nix is based on mathematical functions, there's lots of composition (as in `f°g`), which you can use to mix your C, R, Haskell, and so forth.

Central to Nix is a special Git repository hosted on GitHub called [Nix Packages (Nixpkgs)](https://github.com/NixOS/nixpkgs), which is a large tree of Nix expressions for all kinds of tools and libraries built from a variety of source languages/platforms (enough to support [an entire operating system called NixOS](https://nixos.org/nixos)).

So once we learn the language of Nix, we can build almost anything we want, using Nixpkgs as a starting point. Nix can be very hackable without abandoning a principled architecture.

Nix is not without its problems, as [Gabriel Gonzalez points out](https://github.com/Gabriel439/haskell-nix#background). Nix could use more documentation and tools to ease adoption. Also it takes a lot of work to curate all of Nixpkgs, so you may occasionally find yourself writing your own Nix expressions, or contributing back to the Nix ecosystem. Fortunately, Nix expressions for a particular library or package can be compact.

For many of us the benefits of Nix outweigh the inconveniences. Hopefully, projects and tutorials like this can help tip the balance further.


<a id="orgca71b38"></a>

# Exploring a Fresh Nix Installation

By design, Nix sequesters almost all of its installation under `/nix`. This way, Nix has extremely few dependencies on the surrounding environment.

For non-NixOS installations of Nix, if you deleted `/nix`, you would be very close to a clean uninstallation. Beyond files in `/nix` an installation may also include:

-   a few symlinks in users' home directory

-   a “nix-daemon” service installed into systemd (Linux) or launchd (Mac).

And naturally, and if you run any programs, they might also leave behind application-specific data.

There are two directories under `/nix`:

-   `/nix/store`: where programs are installed

-   `/nix/var`: where mutable metadata, symlinks, caching, and indexing is managed.

Typically, you'll never manage files under `/nix` directly. Instead you'll use the Nix command-line tools. To get packages into `/nix/store` we first need a Nix expression. These expressions can either come from a third party like the central Nixpkgs GitHub repository. Or we can write our own.


<a id="orge42448c"></a>

# The Nix Language

To better discuss the Nix command-line tools and also Nixpkgs, we'll introduce the Nix language a little. This is no substitute for the [official Nix language documentation](https://nixos.org/nix/manual/#ch-expression-language), which is surprisingly not that long for a programming language; Nix does not have much syntax relative to other general-purpose programming languages.


<a id="orgbd6550f"></a>

## Numeric literals

We can play around with the Nix language with the `nix eval` command. As with many languages, we can use Nix as a simple calculator by passing Nix expressions to it:

```shell
nix eval '(1 + 1)'
```

    2

Note, the parentheses are necessary with `nix eval` when passing expressions directly on the command-line. The single-quotes are to pass the whole parenthesized expression as one argument in a shell invocation. If you want less boilerplate, you can also use the `nix repl` command for an interactive session.

Nix supports a variety of types you'd expect for a programming language, and we get some literal syntax for typical primitives:

```shell
nix eval '(builtins.typeOf 1)'
nix eval '(builtins.typeOf 1.0)'
```

    "int"
    "float"


<a id="org29846bc"></a>

## Strings

As you may expect from other languages, Nix supports string literals with the conventional double quote syntax:

```shell
nix eval '(builtins.typeOf "hello")'
```

    "string"

Nix also supports multi-line strings with two consecutive single quotes:

```shell
nix eval "(''
    line 1
      line 2
   line 3
'')"
```

    " line 1\n   line 2\nline 3\n"

The left-most token in any line establishes a left margin. In the example above, this is “line 3”. Beyond these strings, Nix does not have syntactically significant whitespace.

We concatenate strings with the `+` operator:

```shell
nix eval '("a" + "b")'
```

    "ab"
