tutorials/0-nix-intro/README.org
** Let-expressions

   For the most part, Nix is a lazily evaluated purely functional programming
   language. We don't imperatively run commands that change things, and in
   general, the language restricts us from doing so. There's not even syntax to
   do so. At the top-level, you can't bind values to variables as you may in
   other imperative languages. Instead, we are only ever working with a single
   Nix expression at a time, and we bind values to names locally with
   /let-expressions/:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(let a = 1; b = 2; in a + b)'
   #+END_SRC

   #+RESULTS:
   : 3

   Note that semicolons are mandatory in all Nix forms that have them,
   including let-expressions. Because of Nix's strict parsing you can neither
   elide semicolons, nor put extra ones.

** String interpolation

   Sometimes we build up small code snippets inline in a Nix expression, so
   it's useful to have string interpolation support. This is done with the
   following syntax:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(
        let foo = "Foo";
            bar = "Bar";
        in "${foo + bar} is a terrible name")'
   #+END_SRC

   #+RESULTS:
   : "FooBar is a terrible name"

   String interpolation is supported by both normal and multi-line strings.

   Note that unlike shell scripts, the curly braces are not optional for string
   interpolation in Nix. This works out in our favor if we're writing shell
   scripts inline in a Nix expression, because we can use ~$name~ for shell
   string interpolation and ~${nix_expr}~ for Nix string interpolation. If this
   is not enough, though not covered in this tutorial, there is a syntax for
   suppressing interpolation in both normal and multi-line Nix string literals.

** Functions

   Nix has first class functions. Functions take in only one argument at a
   time, and use a colon to separate the parameter name from the body of the
   function. Furthermore, Nix uses whitespace for function application:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(builtins.typeOf (a: a + 1))'
    nix eval '((a: a + 1) 2)'
   #+END_SRC

   #+RESULTS:
   : "lambda"
   : 3

   Since functions take only one argument at a time, they are naturally curried,
   and we encode functions taking multiple arguments with functions returning
   functions:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '((a: b: a + b) 1 2)'
   #+END_SRC

   #+RESULTS:
   : 3

** Lists

   Nix also has list literals which use square brackets and are
   whitespace-delimited:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(builtins.typeOf [1 2 3 4 5])'
   #+END_SRC

   #+RESULTS:
   : "list"

   We can append lists together with the ~++~ operator:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '([1 2] ++ [3 4])'
   #+END_SRC

   #+RESULTS:
   : [ 1 2 3 4 ]

** Attribute sets

   Very importantly, Nix has a kind of map called an /attribute set/ that is
   specialized to have textual indices called /attributes/ that index values of
   arbitrary types. It uses the following syntax:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(builtins.typeOf { foo = 1; bar = 2; })'
     nix eval '({ foo = 1; bar = 2; }.bar)'
   #+END_SRC

   #+RESULTS:
   : "set"
   : 2

   Note, ~builtins~ is just an attribute set that is in scope by default. And
   ~typeOf~ is just an attribute that maps to a function that returns a string
   indicating the type of the argument.

   Often used in Nix expressions, we can overlay sets on top of each other with
   the ~//~ operator:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '({ foo = 1; bar = 2; } // { bar = 3; baz = 4; })'
   #+END_SRC

   #+RESULTS:
   : { bar = 3; baz = 4; foo = 1; }

   Additionally, we can prefix set literals with the ~rec~ keyword to get
   recursive sets. Recursive sets allow values in a set to reference attributes
   by name:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(rec { foo = bar; bar = 2; }.foo)'
   #+END_SRC

   #+RESULTS:
   : 2

   Without the ~rec~ keyword, we'd get an error:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '({ foo = bar; bar = 2; }.foo)' 2>&1 || true
   #+END_SRC

   #+RESULTS:
   : error: undefined variable 'bar' at (string):1:10

   If a function accepts an attribute set as an argument, we can have Nix
   destructure the set as a convenience with the following pattern syntax:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(({ foo, bar }: foo + bar ) { foo = 1; bar = 2; })'
   #+END_SRC

   #+RESULTS:
   : 3

   This basic pattern syntax is strict, and we can't pass in a attribute set
   with attributes that don't match the pattern:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(({ foo }: foo + 2 ) { foo = 3; bar = 4; })' 2>&1 || true
   #+END_SRC

   #+RESULTS:
   : error: anonymous function at (string):1:3 called with unexpected argument 'bar', at (string):1:2

   If we want to accept sets with other attributes we can use a “...” form:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(({ foo, ...}: foo + 2 ) { foo = 3; bar = 4; })'
   #+END_SRC

   #+RESULTS:
   : 5

   When destructuring, we can still bind the whole set to a name if we want
   using a “@” form.

   #+BEGIN_SRC shell :results output :exports both
     nix eval '((s@{ foo, bar }: foo + s.bar ) { foo = 2; bar = 3; })'
   #+END_SRC

   #+RESULTS:
   : 5

   Attribute sets also support an additional syntactic convenience when pulling
   in locally bound values as attributes, which comes up a lot in Nix. For
   example, consider the way we're using ~a = a~ here:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(let a = 3; in { a = a; })'
   #+END_SRC

   #+RESULTS:
   : { a = 3; }

   Rather than worrying about spelling the same name correctly both sides of
   the ‘=’ for an attribute setting, we can use the ~inherit~ key word:

   #+BEGIN_SRC shell :results output :exports both
     nix eval '(let a = 3; in { inherit a; })'
   #+END_SRC

   #+RESULTS:
   : { a = 3; }

** Paths

   Because the Nix language is domain-specific for building packages, it also
   has a /path/ type, which is indicated by an identifier with a slash:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(builtins.typeOf some/path)'
    nix eval '(some/path)'
   #+END_SRC

   #+RESULTS:
   : "path"
   : /home/shajra/src/shajra/example-nix/tutorials/0-nix-intro/some/path

   As part of a standard Nix installation, there's a special environment
   variable ~NIX_PATH~ that makes paths dynamically available to Nix
   expressions:

   #+BEGIN_SRC shell :results output :exports both
    env | grep NIX_PATH
   #+END_SRC

   #+RESULTS:
   : NIX_PATH=nixpkgs=/home/shajra/.nix-defexpr/channels/nixpkgs

   The setting of ~NIX_PATH~ shown above maps the user local path
   =~/.nix-defexpr/channels/nixpkgs= to the identifier ~nixpkgs~, which can be
   accessed in a Nix expression using an angle bracket syntax:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(<nixpkgs>)'
   #+END_SRC

   #+RESULTS:
   : /home/shajra/.nix-defexpr/channels/nixpkgs

   Remember that a major motivation for using Nix is for deterministic builds.
   We have to be extremely careful when using angle brackets to access
   ~NIX_PATH~ because this can make the same Nix expression evaluate differently
   on different systems.

   If you inspect =~/.nix-defexpr/channels/nixpkgs= you'll notice it's a symlink
   pointing to a snapshot of Nixpkgs in =/nix/store=. This symlink is set up
   during Nix installation, and can be upgraded with a call to =nix-channel
   --update=.

** Importing

   We can import paths. If the path is a file, it's loaded as a Nix expression.
   If it's a directory, a file called “default.nix” is loaded within it. A
   snapshot of Nixpkgs, for example, has a =default.nix= file at its root, so
   we can import the path directly:

   #+BEGIN_SRC shell :results output :exports both
    nix eval '(builtins.typeOf (import <nixpkgs>))'
   #+END_SRC

   #+RESULTS:
   : "lambda"

   We see here that Nixpkgs is a function. We'll talk more about the nature of
   the Nixpkgs function next.

