tutorials/0-nix-intro/README.org
* Nixpkgs and Building

  Nixpkgs is a function that takes an attribute set as configuration and
  returns a nested attribute set containing thousands of packages and
  functions. An empty attribute set passed to the Nixpkgs function configures
  it with defaults:

  #+BEGIN_SRC shell :results output :exports both
    nix eval '(builtins.typeOf (import <nixpkgs> {}))'
  #+END_SRC

  #+RESULTS:
  : "set"

  One of the packages in Nixpkgs is the [[hello][GNU Hello]] program, mapped to the
  attribute ~hello~:

  #+BEGIN_SRC shell :results output :exports both
    nix eval '(builtins.typeOf (import <nixpkgs> {}).hello)'
  #+END_SRC

  #+RESULTS:
  : "set"

  At this point, packages in Nixpkgs appear to just be attribute sets, but
  there's a special schema for attributes in a set that allow various Nix
  command-line utilities to recognize the set as a /derivation/ for a package.

  For instance, we can use the ~nix show-derivation~ to view some metadata
  about how Hello will be built:

  #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*)
    nix show-derivation '((import <nixpkgs> {}).hello)'
  #+END_SRC

  #+RESULTS:
  #+begin_example
  {
    "/nix/store/v2l3ncp0ypdssjf7b8rxyppn3kyq3w87-hello-2.10.drv": {
      "outputs": {
        "out": {
          "path": "/nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10"
  …
        "system": "x86_64-linux",
        "version": "2.10"
      }
    }
  }
  #+end_example

  We've cropped the details of the derivation above, but you can get a sense
  that the derivation when evaluated is cached into =/nix/store= as a “*.drv”
  file, and when the application is actually built it's put in another output
  path, also in =/nix/store=.

  Also important to know, when we interpolate a derivation into a string, we
  inject as a string the path of the derivation's output:

  #+BEGIN_SRC shell :results output :exports both
    nix eval '("our value is ${(import <nixpkgs> {}).hello}")'
  #+END_SRC

  #+RESULTS:
  : "our value is /nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10"

  Note, that it may not exist there yet. We can build it with a call to =nix
  build=:

  #+BEGIN_SRC shell :results output :exports both
    nix build --verbose '((import <nixpkgs> {}).hello)' 2>&1
  #+END_SRC

  #+RESULTS:
  : copying path '/nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10' from 'https://cache.nixos.org'...

  If we were to dig into the Nixpkgs repository, we'd find [[nixpkgs-hello][code for building
  Hello from source]]. But notice that we didn't end up fetching the Hello
  released tarball, unpacking it, and building it. Instead, we got a cached
  version of it from https://cache.nixos.org.

  The Nix community builds and caches packages from Nixpkgs in a service called
  [[hydra][Hydra]], which https://cache.nixos.org fronts. If Hydra has the build you're
  trying to build, it's pulled down and cached locally in =/nix/store=.
  Otherwise, everything is built from source and cached in =/nix/store=.

  You've probably also noticed the hashes in names of =/nix/store='s contents.
  Nix meticulously hashes the contents of all the inputs for any package's
  derivation. If a single bit of the input changes, then the resultant hash
  will be different. This is what gives us confidence that the artifacts built
  by Hydra are more or less the same as what we'd have built locally.

  ~nix build~ leaves behind a “result” symlink in the current directory for our
  convenience so we don't have to figure out how to find our build in
  =/nix/store=:

  #+BEGIN_SRC shell :results output :exports results
    tree -L 2 result | sed -e "s|result|result -> $(readlink result)|"
  #+END_SRC

  #+RESULTS:
  : result -> /nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10
  : ├── bin
  : │   └── hello
  : └── share
  :     ├── info
  :     ├── locale
  :     └── man
  :
  : 5 directories, 1 file

  ~nix build~ also supports a ~--no-link~ switch if we want to build without
  leaving behind this “result” symlink.

* Calling =nix=

  We've shown thus far that Nix expressions can be passed to the =nix= utility
  but must be surrounded by parentheses.

  When we call =nix= with an argument not parenthesized, the argument is
  interpreted as an attribute of an attribute set, which is by default built
  from ~NIX_PATH~.

  Consider the following setting of the ~NIX_PATH~ environment variable:

  #+BEGIN_SRC shell :eval no
    NIX_PATH=nixpkgs=/home/shajra/.nix-defexpr/channels/nixpkgs
  #+END_SRC

  With this setting of ~NIX_PATH~, the set that =nix= would choose an attribute
  from would be:

  #+BEGIN_SRC nix :eval no
    {
        nixpkgs = import /home/shajra/.nix-defexpr/channels/nixpkgs {};
    }
  #+END_SRC

  Note that =nix= automatically applies the empty set to any function that's
  detected when imported.

  So we instead of building GNU Hello with this invocation:

  #+BEGIN_SRC shell :results silent
    nix build '((import <nixpkgs> {}).hello)'
  #+END_SRC

  we could just invoke =nix= with:

  #+BEGIN_SRC shell :results silent
    nix build nixpkgs.hello
  #+END_SRC

  Additionally, if we don't want the attribute set built implicitly from
  ~NIX_PATH~, we can use the ~--file~ switch for =nix= to specify explicitly a
  path to be imported and select attributes from.

* Finding Packages

  We took for granted above that Nixpkgs had a package on the ~hello~
  attribute.

  We can find programs in Nix with a ~nix search~ invocation:

  #+BEGIN_SRC shell :eval no
     nix search hello
  #+END_SRC

  # This is just to remove ANSI coloring
  #+BEGIN_SRC shell :results output :exports results
     nix search --update-cache hello | sed "s,\x1B\[[0-9;]*m,,g"
  #+END_SRC

  #+RESULTS:
  #+begin_example
  Attribute name: nixpkgs.gnome3.iagno
  Package name: iagno
  Version: 3.28.0
  Description: Computer version of the game Reversi, more popularly called Othello

  Attribute name: nixpkgs.javaPackages.mavenHello_1_0
  Package name: maven-hello
  Version: 1.0
  Description: Maven Hello World

  Attribute name: nixpkgs.javaPackages.mavenHello_1_1
  Package name: maven-hello
  Version: 1.1
  Description: Maven Hello World

  Attribute name: nixpkgs.hello
  Package name: hello
  Version: 2.10
  Description: A program that produces a familiar, friendly greeting

  Attribute name: nixpkgs.hello-unfree
  Package name: example-unfree-package
  Version: 1.0
  Description: An example package with unfree license (for testing)
  #+end_example

* Running

  If you've never run the GNU Hello program, it's not too interesting. It's
  just a small C program useful for tutorials like this. We can run it using
  the “result” symlink left behind by an invocation of ~nix build~:

  #+BEGIN_SRC shell :results output :exports both
    result/bin/hello
  #+END_SRC

  #+RESULTS:
  : Hello, world!

  Or we can also run it directly without the symlink using ~nix run~:

  #+BEGIN_SRC shell :results output :exports both
    nix run nixpkgs.hello --command hello
  #+END_SRC

  #+RESULTS:
  : Hello, world!

  This invocation makes an environment in which we have the ~nixpkgs.hello~
  package on our path (we can put other packages as well), and then we run the
  command after the ~--command~ switch. See ~nix run --help~ for more information.

