tutorials/0-nix-intro/README.md


<a id="org77d49d7"></a>

# Nixpkgs and Building

Nixpkgs is a function that takes an attribute set as configuration and returns a nested attribute set containing thousands of packages and functions. An empty attribute set passed to the Nixpkgs function configures it with defaults:

```shell
nix eval '(builtins.typeOf (import <nixpkgs> {}))'
```

    "set"

One of the packages in Nixpkgs is the [GNU Hello](https://www.gnu.org/software/hello/) program, mapped to the attribute `hello`:

```shell
nix eval '(builtins.typeOf (import <nixpkgs> {}).hello)'
```

    "set"

At this point, packages in Nixpkgs appear to just be attribute sets, but there's a special schema for attributes in a set that allow various Nix command-line utilities to recognize the set as a *derivation* for a package.

For instance, we can use the `nix show-derivation` to view some metadata about how Hello will be built:

```shell
nix show-derivation '((import <nixpkgs> {}).hello)'
```

    {
      "/nix/store/v2l3ncp0ypdssjf7b8rxyppn3kyq3w87-hello-2.10.drv": {
        "outputs": {
          "out": {
            "path": "/nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10"
    …
          "system": "x86_64-linux",
          "version": "2.10"
        }
      }
    }

We've cropped the details of the derivation above, but you can get a sense that the derivation when evaluated is cached into `/nix/store` as a “\*.drv” file, and when the application is actually built it's put in another output path, also in `/nix/store`.

Also important to know, when we interpolate a derivation into a string, we inject as a string the path of the derivation's output:

```shell
nix eval '("our value is ${(import <nixpkgs> {}).hello}")'
```

    "our value is /nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10"

Note, that it may not exist there yet. We can build it with a call to `nix build`:

```shell
nix build --verbose '((import <nixpkgs> {}).hello)' 2>&1
```

    copying path '/nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10' from 'https://cache.nixos.org'...

If we were to dig into the Nixpkgs repository, we'd find [code for building Hello from source](https://github.com/NixOS/nixpkgs/blob/master/pkgs/applications/misc/hello/default.nix). But notice that we didn't end up fetching the Hello released tarball, unpacking it, and building it. Instead, we got a cached version of it from <https://cache.nixos.org>.

The Nix community builds and caches packages from Nixpkgs in a service called [Hydra](https://nixos.org/hydra/), which <https://cache.nixos.org> fronts. If Hydra has the build you're trying to build, it's pulled down and cached locally in `/nix/store`. Otherwise, everything is built from source and cached in `/nix/store`.

You've probably also noticed the hashes in names of `/nix/store`'s contents. Nix meticulously hashes the contents of all the inputs for any package's derivation. If a single bit of the input changes, then the resultant hash will be different. This is what gives us confidence that the artifacts built by Hydra are more or less the same as what we'd have built locally.

`nix build` leaves behind a “result” symlink in the current directory for our convenience so we don't have to figure out how to find our build in `/nix/store`:

    result -> /nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10
    ├── bin
    │   └── hello
    └── share
        ├── info
        ├── locale
        └── man
    
    5 directories, 1 file

`nix build` also supports a `--no-link` switch if we want to build without leaving behind this “result” symlink.


<a id="orgdc9d11c"></a>

# Calling `nix`

We've shown thus far that Nix expressions can be passed to the `nix` utility but must be surrounded by parentheses.

When we call `nix` with an argument not parenthesized, the argument is interpreted as an attribute of an attribute set, which is by default built from `NIX_PATH`.

Consider the following setting of the `NIX_PATH` environment variable:

```shell
NIX_PATH=nixpkgs=/home/shajra/.nix-defexpr/channels/nixpkgs
```

With this setting of `NIX_PATH`, the set that `nix` would choose an attribute from would be:

```nix
{
    nixpkgs = import /home/shajra/.nix-defexpr/channels/nixpkgs {};
}
```

Note that `nix` automatically applies the empty set to any function that's detected when imported.

So we instead of building GNU Hello with this invocation:

```shell
nix build '((import <nixpkgs> {}).hello)'
```

we could just invoke `nix` with:

```shell
nix build nixpkgs.hello
```

Additionally, if we don't want the attribute set built implicitly from `NIX_PATH`, we can use the `--file` switch for `nix` to specify explicitly a path to be imported and select attributes from.


<a id="orgb47b789"></a>

# Finding Packages

We took for granted above that Nixpkgs had a package on the `hello` attribute.

We can find programs in Nix with a `nix search` invocation:

```shell
nix search hello
```

    Attribute name: nixpkgs.gnome3.iagno
    Package name: iagno
    Version: 3.28.0
    Description: Computer version of the game Reversi, more popularly called Othello
    
    Attribute name: nixpkgs.javaPackages.mavenHello_1_0
    Package name: maven-hello
    Version: 1.0
    Description: Maven Hello World
    
    Attribute name: nixpkgs.javaPackages.mavenHello_1_1
    Package name: maven-hello
    Version: 1.1
    Description: Maven Hello World
    
    Attribute name: nixpkgs.hello
    Package name: hello
    Version: 2.10
    Description: A program that produces a familiar, friendly greeting
    
    Attribute name: nixpkgs.hello-unfree
    Package name: example-unfree-package
    Version: 1.0
    Description: An example package with unfree license (for testing)


<a id="org035db38"></a>

# Running

If you've never run the GNU Hello program, it's not too interesting. It's just a small C program useful for tutorials like this. We can run it using the “result” symlink left behind by an invocation of `nix build`:

```shell
result/bin/hello
```

    Hello, world!

Or we can also run it directly without the symlink using `nix run`:

```shell
nix run nixpkgs.hello --command hello
```

    Hello, world!

This invocation makes an environment in which we have the `nixpkgs.hello` package on our path (we can put other packages as well), and then we run the command after the `--command` switch. See `nix run --help` for more information.
