tutorials/0-nix-intro/README.org
* Installing

  =~/.nix-profile= is a symlink that follows to a /profile/ under
  =/nix/var/nix/profiles= managed by =nix-env=. The profile furthermore points
  to an aggregated symlink tree of various programs installed into the profile
  by =nix-env=, often called an /environment/ (though a very overloaded term).
  Programs installed by =nix-env= are made available to us by putting
  =~/.nix-profile/bin= on our ~PATH~.

  For example, with our ~PATH~ set up the following invocation of =nix-env=
  installs the Hello application so we can call it directly, rather than
  calling it via a “result” symlink or a ~nix run~ invocation:

  #+BEGIN_SRC shell :results output :exports both
    nix-env --install --attr nixpkgs.hello 2>&1
  #+END_SRC

  #+RESULTS:
  : installing 'hello-2.10'
  : building '/nix/store/lwf6zfhyvaxw7g5zjpnbv8rcrq2rvdqn-user-environment.drv'...
  : created 307 symlinks in user environment

  #+BEGIN_SRC shell :exports both
    which hello
  #+END_SRC

  #+RESULTS:
  : /home/shajra/.nix-profile/bin/hello

  We can query with =nix-env= to see what's in our profile:

  #+BEGIN_SRC shell :results output :exports both
    nix-env --query | grep hello
  #+END_SRC

  #+RESULTS:
  : hello-2.10

  Every time we install an application with =nix-env= a new environment symlink
  tree is created in =/nix/store=. For posterity, =nix-env= keeps references to
  old versions under =/nix/var/nix/profiles=. You can use switches like
  ~--rollback~ with =nix-env= to revert back to previous states. See =nix-env
  --help= for more.

* Uninstalling

  If you no longer want an installed application in your profile, you can
  uninstall it with =nix-env= as well:

  #+BEGIN_SRC shell :exports both
    nix-env --uninstall hello 2>&1
  #+END_SRC

  #+RESULTS:
  : uninstalling 'hello-2.10'

  #+BEGIN_SRC shell :exports both
    which hello || true
  #+END_SRC

  #+RESULTS:
  : hello not found

* Inspecting Dependencies

  To find dependencies of a built package, Nix literally scans all files in a
  package (text and even binary) looking for textual references to
  “/nix/store/…”.

  This makes it easy for Nix to find exactly what's needed for any compiled
  artifact to run. These references are often automated by Nix's tooling and
  library support, and it is generally considered a defect if a required
  runtime dependency is missing a reference point back to =/nix/store=.

  This is important, because it allows for different compilations to rely on
  different versions of dependencies without conflicts. Our application
  shouldn't break if we do something like upgrade our host operating system.

  Also, without this clear and reliable method to detect dependencies, garbage
  collection wouldn't know how to keep needed dependencies around.

  If we're curious about all the dependencies, we can use ~nix path-info~ to
  list them out.

  #+BEGIN_SRC shell :results output :exports both
    nix path-info --recursive --closure-size nixpkgs.hello \
        | sort --numeric-sort --key 2
  #+END_SRC

  #+RESULTS:
  : /nix/store/fg4yq8i8wd08xg3fy58l6q73cjy8hjr2-glibc-2.27	   25010512
  : /nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10	   25208040

  Hello doesn't rely on much, just the standard glibc library. In real-world
  programs the dependencies can add up.

* Cleaning Up

  Every time you build a new version of your code, it's stored in =/nix/store=.
  There is a command called =nix-collect-garbage= that purges unneeded
  packages. What keeps a package from being reclaimed by =nix-collect-garbage=
  are symlinks under =/nix/var/nix/gcroots=. These come in a few flavors
  including:

  - indirect links to the “result*” links invocations like ~nix build~ may
    leave on our system

  - links to the currently active =nix-env= environment, as well as all previous
    generations saved away for posterity under =/nix/var/nix/profiles=.

  If you delete a “result*” link and call =nix-collect-garbage=, though some
  garbage may be reclaimed, you may find that an old =nix-env= environment is
  keeping the program alive. We can illustrate this here:

  First, we'll do two =nix-collect-garbage= calls to show that we've reclaimed
  as much space as we can:

  #+BEGIN_SRC shell :results output :exports both
    nix-collect-garbage; nix-collect-garbage
  #+END_SRC

  #+RESULTS:
  : 0 store paths deleted, 0.00 MiB freed
  : 0 store paths deleted, 0.00 MiB freed

  Then we can try to delete our symlink, but another garbage collection doesn't
  doesn't reclaim anything more:

  #+BEGIN_SRC shell :results output :exports both
    rm result
    nix-collect-garbage 2>&1
  #+END_SRC

  #+RESULTS:
  : finding garbage collector roots...
  : removing stale link from '/nix/var/nix/gcroots/auto/3zvhwd2faawz9xbnnr2p4b20q1z86z81' to '/home/shajra/src/shajra/example-nix/tutorials/0-nix-intro/result'
  : deleting garbage...
  : deleting '/nix/store/trash'
  : deleting unused links...
  : note: currently hard linking saves -17.39 MiB
  : 0 store paths deleted, 0.00 MiB freed

  Now with the ~--delete-generations~ switch of =nix-env= we can delete old
  generations of our environment:

  #+BEGIN_SRC shell :results output :exports both
    nix-env --delete-generations old 2>&1
  #+END_SRC

  #+RESULTS:
  : removing generation 251
  : removing generation 252

  And then then garbage collection works as you'd expect:

  #+BEGIN_SRC shell :results output :exports both
    rm result
    nix-collect-garbage 2>&1
  #+END_SRC

  #+RESULTS:
  #+begin_example
  finding garbage collector roots...
  deleting garbage...
  deleting '/nix/store/gb2kq41xf2rv8gy3cx0fkwz49yv5gcsl-user-environment'
  deleting '/nix/store/lwf6zfhyvaxw7g5zjpnbv8rcrq2rvdqn-user-environment.drv'
  deleting '/nix/store/arqc85rvysw5yjlb9gbvi1pwvap9a95f-env-manifest.nix'
  deleting '/nix/store/58r35bqb4f3lxbnbabq718svq9i2pda3-hello-2.10'
  deleting '/nix/store/v2l3ncp0ypdssjf7b8rxyppn3kyq3w87-hello-2.10.drv'
  deleting '/nix/store/13jqqk547i2hn3899zf2nq9nnn94b7sy-hello-2.10.tar.gz.drv'
  deleting '/nix/store/trash'
  deleting unused links...
  note: currently hard linking saves -17.39 MiB
  6 store paths deleted, 1.43 MiB freed
  #+end_example

* Developing with =nix-shell=

  When Nix builds a derivation, it sets up a clean and controlled environment
  in which to do the build. Thus far, we've not inspected how ~nix build~
  works. Nix comes with a =nix-shell= utility that allows us to get the
  environment variables that would be set up for a build. For instance, to get
  into the environment used to build Hello, we could use =nix-shell= as
  follows:

  #+BEGIN_SRC shell :eval no
    nix-shell --expr 'import <nixpkgs> {}' --attr hello
  #+END_SRC

  This drops us into a bash shell we can use interactively. We can also use
  nix-shell with a ~--run~ switch to run a single command non-interactively
  Additionally, we can use the ~--pure~ switch to throw away the previous
  environment variables rather than overlay changes on top of them.

  Here's a small example:

  #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*)
    nix-shell --pure --expr 'import <nixpkgs> {}' --attr hello --run 'env'
  #+END_SRC

  #+RESULTS:
  #+begin_example
  WINDRES=windres
  propagatedBuildInputs=
  stdenv=/nix/store/i6vl5lwlz5jbkg4r6p340dwmj6fha3xq-stdenv-linux
  __ETC_PROFILE_SOURCED=1
  DISPLAY=:0
  …
  SIZE=size
  nativeBuildInputs=
  LD=ld
  depsTargetTargetPropagated=
  _=/nix/store/wm8va53fh5158ipi0ic9gir64hrvqv1z-coreutils-8.29/bin/env
  #+end_example

  We're using ~--expr~ to pass expressions directly to the command line.
  Without this switch, =nix-shell= looks for a =shell.nix= file to import in
  the current working directory. If that's not found, it looks for
  =default.nix=. Otherwise, a file can be passed as a positional parameter.

  =nix-shell= is great for the following two scenarios, which we'll explore in
  later tutorials:

  - debugging a Nix build/derivation

  - entering into a development environment for a project.

  In our derivations we can include as build dependencies not only things like
  compilers that we absolutely need for a build, but also optional tools for
  developer conveniences. This means that with =nix-shell=, we have different
  tools installed per-project, rather than worrying about having the right tool
  installed at a system- or user-level.

